In [15]:
import numpy as np
import pandas as pd

In [3]:
file_path = "/workspaces/TIR101/etl/src/data_with_nan.csv"

df = pd.read_csv(file_path)

df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [9]:
df2 = pd.DataFrame(
    data=[
        [None, 123, "test"],
        [None, None, "test2"],
    ],
    columns=["col1", "col2", "col3"]
)

df2

   col1   col2   col3
0  None  123.0   test
1  None    NaN  test2

In [10]:
df["col3"][5]

nan

In [11]:
df2["col2"][1]

nan

In [7]:
type(df["col3"][5])

float

In [8]:
type(df2["col2"][1])

NoneType

In [12]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [13]:
df[
    df["col1"].isna()
]

  col1  col2 col3
3  NaN   NaN  NaN
5  NaN   NaN  NaN

In [14]:
df2[
    df2["col1"].isna()
]

   col1   col2   col3
0  None  123.0   test
1  None    NaN  test2

In [16]:
df2 = pd.DataFrame(
    data=[
        [np.nan, 123, "test"],
        [np.nan, np.nan, "test2"],
    ],
    columns=["col1", "col2", "col3"]
)

df2

   col1   col2   col3
0   NaN  123.0   test
1   NaN    NaN  test2

In [17]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [18]:
df["col1"].fillna("Unknown")

0      test1
1      test2
2      test3
3    Unknown
4      test5
5    Unknown
Name: col1, dtype: object

In [19]:
df["col_1_operated"] = df["col1"].fillna("Unknown")
df

    col1  col2 col3 col_1_operated
0  test1  13.0  NaN          test1
1  test2  44.0  aaa          test2
2  test3   NaN  NaN          test3
3    NaN   NaN  NaN        Unknown
4  test5   NaN  bbb          test5
5    NaN   NaN  NaN        Unknown

In [20]:
df["col1"].ffill()

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object

In [21]:
df["col1"].bfill()

0    test1
1    test2
2    test3
3    test5
4    test5
5      NaN
Name: col1, dtype: object

In [22]:
np.where(
    df["col1"].isna(),
    "other",
    df["col1"],
)

array(['test1', 'test2', 'test3', 'other', 'test5', 'other'], dtype=object)

In [23]:
np.where(
    df["col1"].isna(),
    "other",
    df["col1"].apply(lambda x: x),
)

array(['test1', 'test2', 'test3', 'other', 'test5', 'other'], dtype=object)

In [24]:
df

    col1  col2 col3 col_1_operated
0  test1  13.0  NaN          test1
1  test2  44.0  aaa          test2
2  test3   NaN  NaN          test3
3    NaN   NaN  NaN        Unknown
4  test5   NaN  bbb          test5
5    NaN   NaN  NaN        Unknown

In [25]:
df.dropna()

    col1  col2 col3 col_1_operated
1  test2  44.0  aaa          test2

In [26]:
df.dropna(thresh=2)

    col1  col2 col3 col_1_operated
0  test1  13.0  NaN          test1
1  test2  44.0  aaa          test2
2  test3   NaN  NaN          test3
4  test5   NaN  bbb          test5